In [1]:
import pandas as pd

In [2]:
from pandas import Series, DataFrame

In [3]:
obj = pd.Series([4, 7, 5, 3])

In [4]:
obj

0    4
1    7
2    5
3    3
dtype: int64

In [5]:
obj2 = pd.Series([4, 7, 5 ,3], index = ['a', 'b', 'c', 'd'])

In [6]:
obj2

a    4
b    7
c    5
d    3
dtype: int64

In [7]:
obj2.name = 'number'

In [8]:
obj2

a    4
b    7
c    5
d    3
Name: number, dtype: int64

In [9]:
data = {'state' : ['ohio', 'ohio', 'ohio', 'nevada' ,'nevada', 'nevada'],
       'year' : [2000, 2001, 2002, 2001, 2002, 2003],
       'pop' : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [10]:
frame

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  nevada  2001  2.4
4  nevada  2002  2.9
5  nevada  2003  3.2

In [11]:
pd,DataFrame(data, columns = ['year', 'pop', 'state'])

(<module 'pandas' from 'C:\\ProgramData\\Anaconda3\\lib\\site-packages\\pandas\\__init__.py'>,
    year  pop   state
 0  2000  1.5    ohio
 1  2001  1.7    ohio
 2  2002  3.6    ohio
 3  2001  2.4  nevada
 4  2002  2.9  nevada
 5  2003  3.2  nevada)

In [17]:
frame['pop'] = np.arange(6)

In [13]:
import numpy as np

In [18]:
obj = pd.Series(range(3), index = ['a', 'b', 'c'])

In [19]:
index = obj.index

In [20]:
index

Index(['a', 'b', 'c'], dtype='object')

In [21]:
obj

a    0
b    1
c    2
dtype: int64

In [22]:
obj = obj.reindex(['c', 'd','e','f'])

In [23]:
obj

c    2.0
d    NaN
e    NaN
f    NaN
dtype: float64

In [24]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index = [0,2,4])

In [25]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [26]:
obj3.reindex(range(6), method = 'ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [28]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index = ['a', 'b', 'c'],
                     columns = ['ohio' , 'texas', 'california'])

In [29]:
frame

   ohio  texas  california
a     0      1           2
b     3      4           5
c     6      7           8

In [30]:
states = ['texas' ,'utah', 'california']

In [31]:
frame.reindex(columns = states)

   texas  utah  california
a      1   NaN           2
b      4   NaN           5
c      7   NaN           8

In [32]:
frame

   ohio  texas  california
a     0      1           2
b     3      4           5
c     6      7           8

In [33]:
data

{'state': ['ohio', 'ohio', 'ohio', 'nevada', 'nevada', 'nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [38]:
data = pd.DataFrame(data)

In [39]:
data

Empty DataFrame
Columns: []
Index: []

In [40]:
data

Empty DataFrame
Columns: []
Index: []

In [41]:
frame

   ohio  texas  california
a     0      1           2
b     3      4           5
c     6      7           8

In [43]:
frame.iloc[2]

ohio          6
texas         7
california    8
Name: c, dtype: int32

In [44]:
frame.loc[:'b', 'texas']

a    1
b    4
Name: texas, dtype: int32

In [46]:
df1 = pd.DataFrame(np.arange(12).reshape(3, 4),
                  columns = list('abcd'))

In [47]:
df2 = pd.DataFrame(np.arange(20).reshape(4, 5),
                  columns = list('abcde'))

In [48]:
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [49]:
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [50]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [51]:
df1.add(df2, fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [55]:
frame = pd.DataFrame(np.random.randn(4, 3), columns = list('bde'),
                    index = ['utah', 'ohio', 'texas', 'oregon'])

In [56]:
frame

               b         d         e
utah   -0.508383 -0.254815 -1.841023
ohio   -0.034394 -0.345429 -1.033357
texas   1.201908 -1.354833 -1.182830
oregon -0.498589 -1.501960 -1.249523

In [57]:
np.abs(frame)

               b         d         e
utah    0.508383  0.254815  1.841023
ohio    0.034394  0.345429  1.033357
texas   1.201908  1.354833  1.182830
oregon  0.498589  1.501960  1.249523

In [1]:
import numpy as np
import pandas as pd

In [2]:
f = lambda x : x.max() - x.min()

In [3]:
frame = pd.DataFrame(np.random.randn(4,3), columns = list('bde'),
                    index = ['utah', 'ohio', 'texas', 'oregon'])

In [4]:
frame

               b         d         e
utah   -0.650762 -1.067852  1.385126
ohio    0.676459  0.063103 -1.725895
texas  -1.408575  1.161001 -0.174947
oregon -0.605594 -0.143877  1.105571

In [5]:
frame.apply(f)

b    2.085034
d    2.228853
e    3.111021
dtype: float64

In [6]:
# 그 열에서의 최대최소를 구하는 코딩

In [7]:
def f(x) :
    return pd.Series([x.min(), x.max()], index = ['min' ,'max'])

In [8]:
frame.apply(f)

            b         d         e
min -1.408575 -1.067852 -1.725895
max  0.676459  1.161001  1.385126

In [11]:
obj = pd.Series(range(4), index = list('dabc'))bj

SyntaxError: invalid syntax (Temp/ipykernel_26808/1956522453.py, line 1)

In [12]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [14]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [15]:
frame = pd.DataFrame(np.arange(8).reshape(2, 4), index = ['three' ,'one'],
                    columns = list('dabc'))

In [16]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [17]:
frame.sort_index(axis = 1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [18]:
obj = pd.Series([4, 7, 3, 2])

In [19]:
obj

0    4
1    7
2    3
3    2
dtype: int64

In [20]:
obj.sort_values()

3    2
2    3
0    4
1    7
dtype: int64

In [21]:
obj.append(2, 4, 1, 3)

TypeError: append() takes from 2 to 4 positional arguments but 5 were given

#### obj

In [23]:
frame = pd.DataFrame({'b' : [4, 7, -3, 2], 'a' : [0, 1, 0, 1] })

In [24]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [25]:
frame.sort_index(axis = 1)

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [26]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [27]:
frame = frame.sort_index(axis = 1)

In [28]:
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [30]:
frame.sort_values(by = ['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [37]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]], 
                 index = ['a', 'b', 'c', 'd'], columns = ['one', 'two'])

In [33]:
import numpy as np

In [39]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [40]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [41]:
df.sum(axis = 1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [42]:
df.idxmax()

one    b
two    d
dtype: object

In [43]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [51]:
pip install pandas-datareader
# 야후 금융사이트에서 구한 주식가격과 시가총액을 담고있는 데이터프레임설치

Collecting pandas-datareader
  Downloading pandas_datareader-0.10.0-py3-none-any.whl (109 kB)
Requirement already satisfied: requests>=2.19.0 in c:\programdata\anaconda3\lib\site-packages (from pandas-datareader) (2.26.0)
Requirement already satisfied: pandas>=0.23 in c:\programdata\anaconda3\lib\site-packages (from pandas-datareader) (1.3.4)
Requirement already satisfied: lxml in c:\programdata\anaconda3\lib\site-packages (from pandas-datareader) (4.6.3)
Requirement already satisfied: pytz>=2017.3 in c:\programdata\anaconda3\lib\site-packages (from pandas>=0.23->pandas-datareader) (2021.3)
Requirement already satisfied: numpy>=1.17.3 in c:\programdata\anaconda3\lib\site-packages (from pandas>=0.23->pandas-datareader) (1.20.3)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\programdata\anaconda3\lib\site-packages (from pandas>=0.23->pandas-datareader) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas>=0.23->pandas-datareader) (1.16.0)
Requirement already satisfied: idna<4,>=2.5 in c:\programdata\anaconda3\lib\site-packages (from requests>=2.19.0->pandas-datareader) (3.2)
Requirement already satisfied: charset-normalizer~=2.0.0 in c:\programdata\anaconda3\lib\site-packages (from requests>=2.19.0->pandas-datareader) (2.0.4)
Requirement already satisfied: certifi>=2017.4.17 in c:\programdata\anaconda3\lib\site-packages (from requests>=2.19.0->pandas-datareader) (2021.10.8)
Requirement already satisfied: urllib3<1.27,>=1.21.1 in c:\programdata\anaconda3\lib\site-packages (from requests>=2.19.0->pandas-datareader) (1.26.7)
Installing collected packages: pandas-datareader
Successfully installed pandas-datareader-0.10.0
Note: you may need to restart the kernel to use updated packages.

In [52]:
import pandas_datareader.data as web

In [54]:
all_data = {ticker: web.get_data_yahoo(ticker)
           for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}
price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
                      for ticker, data in all_data.items()})

In [55]:
returns = price.pct_change()  # 주식의 퍼센트 변화율

In [56]:
returns.tail() #뒤의 5개 데이터를 추출

                AAPL       IBM      MSFT      GOOG
Date
2022-02-08  0.018467 -0.001603  0.011995  0.001979
2022-02-09  0.008294  0.005619  0.021835  0.016090
2022-02-10 -0.023599 -0.019317 -0.028373 -0.020152
2022-02-11 -0.020218 -0.006216 -0.024274 -0.032269
2022-02-14  0.001423 -0.019142 -0.000136  0.008723

In [58]:
returns['MSFT'].corr (returns['IBM'])

0.4833408686549973

In [59]:
returns['MSFT'].cov (returns['IBM'])

0.00014161950152959693

In [60]:
returns.MSFT.corr(returns.IBM)

0.4833408686549973

In [62]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.427666  0.742676  0.661304
IBM   0.427666  1.000000  0.483341  0.455330
MSFT  0.742676  0.483341  1.000000  0.780643
GOOG  0.661304  0.455330  0.780643  1.000000

In [63]:
returns.corrwith(returns.IBM)

AAPL    0.427666
IBM     1.000000
MSFT    0.483341
GOOG    0.455330
dtype: float64

In [64]:
# value_counts() : 시리즈에서 도수를 계산해줌

In [67]:
obj = pd.Series(['a', 'c', 'd', 'e', 'e', 'a', 'a', 'b'])

In [68]:
obj

0    a
1    c
2    d
3    e
4    e
5    a
6    a
7    b
dtype: object

In [69]:
uniques = obj.unique()

In [71]:
uniques

array(['a', 'c', 'd', 'e', 'b'], dtype=object)

In [73]:
uniques.sort()

In [74]:
uniques

array(['a', 'b', 'c', 'd', 'e'], dtype=object)

In [75]:
obj.value_counts()

a    3
e    2
c    1
d    1
b    1
dtype: int64

In [76]:
!cat ex1.csv

'cat'은(는) 내부 또는 외부 명령, 실행할 수 있는 프로그램, 또는
배치 파일이 아닙니다.

In [77]:
!cat ex1.txt

'cat'은(는) 내부 또는 외부 명령, 실행할 수 있는 프로그램, 또는
배치 파일이 아닙니다.

In [80]:
!type ex1.csv

지정된 파일을 찾을 수 없습니다.

In [79]:
!type ex1.txt

지정된 파일을 찾을 수 없습니다.

In [90]:
df = pd.read_csv(r'C:\Users\KO\all code\pythondata\ex1.csv', header = None)

In [91]:
df

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo